

city:list=[["北京市", "11"], ["天津市", "12"], ["河北省", "13"], ["山西省", "14"], ["辽宁省", "21"], ["吉林省", "22"],
               ["江苏省", "32"], ["上海市", "31"], ["浙江省", "33"], ["安徽省", "34"], ["福建省", "35"], ["江西省", "36"],
               ["山东省", "37"], ["河南省", "41"], ["湖北省", "42"], ["湖南省", "43"], ["广东省", "44"], ["海南市", "46"],
               ["重庆市", "50"], ["四川省", "51"], ["贵州省", "52"], ["陕西省", "61"], ["甘肃省", "62"], ["云南省", "53"],
               ["台湾省", "71"], ["青海省", "63"], ["宁夏回族自治区", "64"], ["广西壮族自治区", "45"], ["西藏自治区","54"],
               ["新疆维吾尔自治区", "65"], ["香港特别行政区", "81"], ["澳门特别行政区", "82"], ["内蒙古自治区", "15"], ["黑龙江省", "23"]]
def GetAllCity():
    '''
    这个函数获取国内的省市和直辖市的名称和省市代码
    return:
        返回一个list，list里面为城市名称和代码的list
        例:[["北京市", "11"], ["天津市", "12"],...]
    '''
    return city
sign:str = [["摩羯座","20"], ["水瓶座","19"], ["双鱼座","21"], ["白羊座","20"], ["金牛座","21"],
                ["双子座","22"], ["巨蟹座","23"], ["狮子座","23"], ["处女座","23"], ["天秤座","24"],
                ["天蝎座","23"], ["射手座","22"], ["摩羯座","0"]]

def GetSign():
    '''
    这个函数返回所有星座
    return:
        返回一个list，list里面是按规律排序的星座和切割日期
        例:[["摩羯座","20"], ["水瓶座","19"],...]
    '''
    return sign