#encoding=utf-8
from __future__ import unicode_literals
import sys
sys.path.append("../")

import tkitW2vec


w2v=tkitW2vec.Word2vec()
w2v.load(model_file='../model/word2vec_demo.model')
# w2v.load(model_file='../model/word2vec.vector.model')
# w2v.save(model_file='../model/word2vec.vector.model',binary=True)
# 提取关键词
text="""


#流浪猫#当生活要给你沉重一击时，它不会管你是身处什么样的环境，也不管你是不是有能力去应对，而你要做的要么是坚持，要么是放弃。
就像是这只被取名叫“大吉”的橘猫，它一出生就没有后腿，而且还不得不跟着自己的妈妈过着流浪生活，幸运的是猫妈妈没有因为橘猫天生有残疾就将它抛弃了。

猫妈妈一直在街边生活，可能是因为它每天都能看到人来人往的行人的缘故，因此它对人的警惕性比住在野外的野猫要低很多，性格自然也没有这么锋芒。
在大吉出生以前，猫妈妈就已经在街上生活了好长的一段时间，它所生活的地方有一户商家一直在接济猫妈妈，当然偶尔也会有行人在帮助猫妈妈。

所以对于猫妈妈而言，它的流浪生活还算比较惬意，既有自由又有美味的食物。因此当大吉出生以后，它便跟着猫妈妈一起得到别人的接济。
对于流浪猫而言，如果每天都能得到人类的接济，即便身体残疾也不会对生活有太大的影响，只是不能跟其它猫咪一样可以自由玩耍而已。
大吉一出生就接触了人类，因此它对人有着强烈的好感，长大以后的大吉由于不能跟同伴一起玩耍，因此它常常去找接济它的商店老板寻求关爱。

猫妈妈平时除了吃饭都是自己出去玩耍，唯独留下大吉待在一个地方哪里也去不了，这时老板便成为大吉眼中的朋友。


每当大吉找老板一起玩耍的时候，它都必须横穿一条马路，路上偶尔有车辆来往，因此大家也很担心大吉会出现意外。

白天时间有行人、老板会帮助大吉过马路，可是到了晚上，就没办法保护大吉的安全。可能会有人说既然担心大吉出意外，又为什么不愿意收养它？


其实这样的行为也很容易理解，因为照顾有残疾的宠物不是一朝一夕的事情，所以谁都不能保证自己能为大吉的一生负责到底。

一时的善心不难，难的是在有善心的同时还要有高度的宽容和忍耐。如果不是真心的喜欢宠物，是很难能做到对宠物的一生负责，更不要说是一只身患残疾的宠物。

"""
text="猫妈妈刚走的那几天，大吉每天哪里也不去，它只想待在曾经与妈妈一起生活的地方，这里还有妈妈的味道，似乎唯有这样它就能继续感受有妈妈陪伴的日子。"
kws=w2v.keywords(text)
# print(kws[:10])
print("排名前十的关键词")
for word,rank in kws[:10]:
    print(word,"----》",rank )


w='小野猫'
print(w,"的同义词")
kws=w2v.most_similar(w)
for word,rank in kws[:10]:
    print(word,"----》",rank )
 
 


print("句子纠错")

s="流ni浪猫当生活要给你沉重一击时，它不会管你是身处什么样的环境，也不管你是不是有能力去应对，而你要做的要么是坚持，要么是放弃。"
print( w2v.doesnt_match(s))
# print(w2v.path)



# # 寻找对应关系
print (u"书-不错，质量-")
y3 = w2v.model.most_similar("收养流浪猫","狗", topn=3)
for item in y3:
  print (item[0], item[1])
print ("--------\n")

print("摘要")
print(w2v.summary(text))